#+options: num:nil toc:nil ^:nil

#+macro: mire *Mire of the Damned*
#+macro: haven *Free Haven*
#+macro: dragon *Dragonsand*
#+macro: black *Blackshire*
#+macro: paradise *Paradise Valley*
#+macro: krieg *Kriegspire*

** TODO Moon Temple

Riddle at the top of the door

#+begin_src emacs-lisp :exports list
  (require 'reazon)

  (reazon-run 5 (q)
    ;; Life above all
    (reazon-caro q 'life)
    ;; Accuracy before might
    (reazon-precedeso 'accuracy 'might q)
    ;; Endurance before speed
    (reazon-precedeso 'endurance 'speed q)
    ;; finally luck
    (reazon-fresh (beginning)
      (reazon-appendo beginning '(luck) q))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (reazon-subseto '(life might accuracy endurance) q))
#+end_src

#+RESULTS:
| (life accuracy might endurance speed luck)       |
| (life accuracy endurance might speed luck)       |
| (life accuracy might endurance speed life luck)  |
| (life accuracy might endurance speed _0 luck)    |
| (life accuracy might endurance speed might luck) |

